app/views/guests/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."guest_id" = ?  [["guest_id", 2]]
---
<ul>
  <% @guest.orders.each do |order| %>