app/controllers/drinks_controller.rb

  def create
    @drink = Drink.new(drink_params)
    @drink.save
---
INSERT INTO "drinks" ("booze", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["booze", "Whiskey"], ["created_at", Sat, 08 Feb 2014 17:12:55 UTC +00:00], ["name", "Manhattan"], ["updated_at", Sat, 08 Feb 2014 17:12:55 UTC +00:00]]

  def index
    @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"