app/controllers/guests_controller.rb

INSERT INTO "guests" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 08 Feb 2014 17:05:03 UTC +00:00], ["first_name", "Minnie"], ["last_name", "Mouse"], ["updated_at", Sat, 08 Feb 2014 17:05:03 UTC +00:00]]
---
  def create
    @guest = Guest.new(guest_params)
    @guest.save

SELECT "guests".* FROM "guests"
---
  def index
    @guests = Guest.all

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 2 LIMIT 1
SELECT "drinks".* FROM "drinks"
---
  def show
    @guest = Guest.find(params[:id])
    @drinks = Drink.all