app/controllers/orders_controller.rb

  def create
    OrderAdjuster.add_order(params[:guest_id], params[:drink_id])

    redirect_to guest_path(Guest.find(params[:guest_id]))
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    OrderAdjuster.delete_order(params[:guest_id], params[:drink_id])

    redirect_to guest_path(Guest.find(params[:guest_id]))
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 11]]
SELECT "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT 1  [["id", "2"]]